<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Aggregating-and-Combining-pandas-DataFrames" data-toc-modified-id="Aggregating-and-Combining-pandas-DataFrames-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Aggregating and Combining <code>pandas</code> DataFrames</a></span><ul class="toc-item"><li><span><a href="#Objectives" data-toc-modified-id="Objectives-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Objectives</a></span></li></ul></li><li><span><a href="#Loading-Example-Data:-Austin-Animal-Center-Data" data-toc-modified-id="Loading-Example-Data:-Austin-Animal-Center-Data-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Loading Example Data: Austin Animal Center Data</a></span></li><li><span><a href="#Aggregating-over-DataFrames:-.groupby()" data-toc-modified-id="Aggregating-over-DataFrames:-.groupby()-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Aggregating over DataFrames: <code>.groupby()</code></a></span><ul class="toc-item"><li><span><a href="#.groups-and-.get_group()" data-toc-modified-id=".groups-and-.get_group()-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span><code>.groups</code> and <code>.get_group()</code></a></span><ul class="toc-item"><li><span><a href="#Multi-Indexing" data-toc-modified-id="Multi-Indexing-3.1.1"><span class="toc-item-num">3.1.1&nbsp;&nbsp;</span>Multi-Indexing</a></span></li></ul></li><li><span><a href="#Aggregating" data-toc-modified-id="Aggregating-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Aggregating</a></span></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Pivoting-a-DataFrame" data-toc-modified-id="Pivoting-a-DataFrame-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Pivoting a DataFrame</a></span><ul class="toc-item"><li><span><a href="#.pivot_table()" data-toc-modified-id=".pivot_table()-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span><code>.pivot_table()</code></a></span><ul class="toc-item"><li><span><a href="#Example" data-toc-modified-id="Example-4.1.1"><span class="toc-item-num">4.1.1&nbsp;&nbsp;</span>Example</a></span></li><li><span><a href="#Back-to-Austin-animals" data-toc-modified-id="Back-to-Austin-animals-4.1.2"><span class="toc-item-num">4.1.2&nbsp;&nbsp;</span>Back to Austin animals</a></span></li></ul></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Methods-for-Combining-DataFrames:-.join(),-.merge(),-pd.concat()" data-toc-modified-id="Methods-for-Combining-DataFrames:-.join(),-.merge(),-pd.concat()-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Methods for Combining DataFrames: <code>.join()</code>, <code>.merge()</code>, <code>pd.concat()</code></a></span><ul class="toc-item"><li><span><a href="#.join()" data-toc-modified-id=".join()-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span><code>.join()</code></a></span></li><li><span><a href="#.merge()" data-toc-modified-id=".merge()-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span><code>.merge()</code></a></span></li><li><span><a href="#The-how-Parameter" data-toc-modified-id="The-how-Parameter-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>The <code>how</code> Parameter</a></span></li><li><span><a href="#pd.concat()" data-toc-modified-id="pd.concat()-5.4"><span class="toc-item-num">5.4&nbsp;&nbsp;</span><code>pd.concat()</code></a></span></li></ul></li><li><span><a href="#King-County-Assessments" data-toc-modified-id="King-County-Assessments-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>King County Assessments</a></span><ul class="toc-item"><li><span><a href="#First,-get-the-data!" data-toc-modified-id="First,-get-the-data!-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>First, get the data!</a></span></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Time-Permitting:-Data-Cleaning-Exercises-with-Pandas" data-toc-modified-id="Time-Permitting:-Data-Cleaning-Exercises-with-Pandas-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Time Permitting: Data Cleaning Exercises with Pandas</a></span><ul class="toc-item"><li><span><a href="#Investigate-and-drop-rows-with-invalid-values-in-the-SalePrice-and-SqFtTotLiving-columns." data-toc-modified-id="Investigate-and-drop-rows-with-invalid-values-in-the-SalePrice-and-SqFtTotLiving-columns.-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Investigate and drop rows with invalid values in the SalePrice and SqFtTotLiving columns.</a></span></li><li><span><a href="#Investigate-and-handle-non-numeric-ZipCode-values" data-toc-modified-id="Investigate-and-handle-non-numeric-ZipCode-values-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Investigate and handle non-numeric ZipCode values</a></span></li><li><span><a href="#Add-a-column-for-PricePerSqFt" data-toc-modified-id="Add-a-column-for-PricePerSqFt-7.3"><span class="toc-item-num">7.3&nbsp;&nbsp;</span>Add a column for PricePerSqFt</a></span></li><li><span><a href="#Subset-the-data-to-2021-sales-only" data-toc-modified-id="Subset-the-data-to-2021-sales-only-7.4"><span class="toc-item-num">7.4&nbsp;&nbsp;</span>Subset the data to 2021 sales only</a></span></li><li><span><a href="#What-is-the-mean-price-per-square-foot-for-a-house-sold-in-Seattle-in-2021?" data-toc-modified-id="What-is-the-mean-price-per-square-foot-for-a-house-sold-in-Seattle-in-2021?-7.5"><span class="toc-item-num">7.5&nbsp;&nbsp;</span>What is the mean price per square foot for a house sold in Seattle in 2021?</a></span></li></ul></li><li><span><a href="#Level-Up:-pandas.set_option()" data-toc-modified-id="Level-Up:-pandas.set_option()-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Level Up: <code>pandas.set_option()</code></a></span><ul class="toc-item"><li><span><a href="#Block-Scientific-Notation" data-toc-modified-id="Block-Scientific-Notation-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Block Scientific Notation</a></span></li><li><span><a href="#See-More-Rows" data-toc-modified-id="See-More-Rows-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>See More Rows</a></span></li></ul></li></ul></div>

In [1]:
import pandas as pd
import numpy as np
import requests as rq
from sklearn.preprocessing import OneHotEncoder
from zipfile import ZipFile

# Aggregating and Combining `pandas` DataFrames

## Objectives

- Use GroupBy objects to organize and aggregate data
- Create pivot tables from DataFrames
- Combine DataFrames by merging and appending

We'll work with the Austin Animal Center dataset and with data from King County's Department of Assessments (Seattle housing data).

# Loading Example Data: Austin Animal Center Data

In [2]:
data = rq.get('https://data.austintexas.gov/resource/9t4d-g238.json').text

In [3]:
animals = pd.read_json(data)

In [4]:
animals.head()

,animal_id,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,name
0,A841916,2021-09-06 12:16:00,2021-09-06T12:16:00.000,2021-03-06T00:00:00.000,Euthanasia,Rabies Risk,Other,Unknown,NULL,Skunk,Black/White,NaN
1,A841797,2021-09-05 19:27:00,2021-09-05T19:27:00.000,2019-09-03T00:00:00.000,Euthanasia,Rabies Risk,Other,Unknown,2 years,Raccoon,Black/Gray,NaN
2,A841851,2021-09-05 19:27:00,2021-09-05T19:27:00.000,2021-07-04T00:00:00.000,Euthanasia,Rabies Risk,Other,Unknown,2 months,Raccoon,Black/Gray,NaN
3,A838096,2021-09-05 18:55:00,2021-09-05T18:55:00.000,2018-07-02T00:00:00.000,Adoption,NaN,Dog,Neutered Male,3 years,Plott Hound,Brown Brindle,Tex
4,A841829,2021-09-05 18:15:00,2021-09-05T18:15:00.000,2014-09-03T00:00:00.000,Euthanasia,Suffering,Dog,Spayed Female,7 years,Labrador Retriever Mix,Brown,Hershey

# Aggregating over DataFrames: `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. (And if you haven't, you'll see it very soon!) Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [5]:
animals.groupby('animal_type')

In [6]:
animals.columns

Index(['animal_id', 'datetime', 'monthyear', 'date_of_birth', 'outcome_type',
       'outcome_subtype', 'animal_type', 'sex_upon_outcome',
       'age_upon_outcome', 'breed', 'color', 'name'],
      dtype='object')

We can group by multiple columns, and also return a DataFrameGroupBy object

Notice the object type [DataFrameGroupBy](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html) object.

## `.groups` and `.get_group()`

In [7]:
animals.groupby(['animal_type', 'outcome_type'])

In [14]:
# This retuns each group indexed by the group name, e.g. 'Bird',
# along with the row indices of each value

animals.groupby('animal_type').groups

{'Bird': [593, 604], 'Cat': [5, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19, 24, 28, 31, 35, 45, 46, 47, 48, 50, 54, 56, 63, 66, 67, 68, 70, 71, 75, 82, 84, 86, 87, 88, 89, 90, 91, 92, 95, 96, 98, 100, 101, 108, 111, 112, 117, 118, 120, 122, 123, 128, 129, 130, 131, 134, 135, 139, 140, 141, 144, 147, 149, 155, 157, 158, 166, 167, 168, 169, 170, 172, 173, 174, 179, 183, 184, 186, 189, 191, 192, 193, 195, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 213, 214, 215, 216, ...], 'Dog': [3, 4, 6, 10, 20, 21, 22, 23, 25, 26, 27, 29, 30, 32, 34, 36, 37, 38, 39, 40, 41, 42, 43, 44, 49, 51, 52, 55, 57, 58, 59, 60, 61, 62, 64, 65, 72, 73, 74, 76, 77, 79, 80, 81, 83, 85, 93, 94, 97, 99, 102, 103, 104, 105, 106, 107, 109, 110, 113, 114, 115, 116, 119, 121, 124, 125, 126, 127, 132, 133, 136, 137, 142, 143, 145, 146, 148, 150, 151, 152, 153, 154, 156, 159, 163, 164, 165, 171, 175, 176, 177, 178, 180, 185, 187, 188, 190, 194, 196, 208, ...], 'Other': [0, 1, 2, 33, 53, 69, 78, 138, 160, 161, 162, 181, 182, 277, 278, 291, 334, 363, 364, 365, 366, 420, 458, 563, 566, 601, 660, 724, 732, 811, 911, 912, 913, 966, 967, 970, 971, 986]}

Once we know we are working with a type of object, it opens up a suite of attributes and methods. One attribute we can look at is groups.

In [9]:
# Once we know the group indices, we can return the groups using those indices.
animals.groupby('animal_type').get_group('Dog')

,animal_id,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,name
3,A838096,2021-09-05 18:55:00,2021-09-05T18:55:00.000,2018-07-02T00:00:00.000,Adoption,NaN,Dog,Neutered Male,3 years,Plott Hound,Brown Brindle,Tex
4,A841829,2021-09-05 18:15:00,2021-09-05T18:15:00.000,2014-09-03T00:00:00.000,Euthanasia,Suffering,Dog,Spayed Female,7 years,Labrador Retriever Mix,Brown,Hershey
6,A840762,2021-09-05 17:58:00,2021-09-05T17:58:00.000,2019-08-13T00:00:00.000,Adoption,NaN,Dog,Neutered Male,2 years,Boxer Mix,Red/White,*Marco
10,A840175,2021-09-05 17:21:00,2021-09-05T17:21:00.000,2021-04-03T00:00:00.000,Adoption,NaN,Dog,Spayed Female,5 months,Labrador Retriever,Black Brindle/White,*Holly
20,A835952,2021-09-05 16:42:00,2021-09-05T16:42:00.000,2019-12-03T00:00:00.000,Adoption,NaN,Dog,Neutered Male,1 year,Pit Bull Mix,Brown Brindle,Draco
...,...,...,...,...,...,...,...,...,...,...,...,...
985,A671512,2021-08-12 16:31:00,2021-08-12T16:31:00.000,2013-01-25T00:00:00.000,Adoption,NaN,Dog,Spayed Female,8 years,Labrador Retriever Mix,Brown,Zephyr
988,A840349,2021-08-12 16:16:00,2021-08-12T16:16:00.000,2021-04-12T00:00:00.000,Adoption,NaN,Dog,Spayed Female,4 months,Australian Cattle Dog Mix,Black/Tricolor,Lucy Lu
989,A840686,2021-08-12 15:42:00,2021-08-12T15:42:00.000,2019-08-12T00:00:00.000,Return to Owner,NaN,Dog,Intact Male,2 years,German Shepherd,Black/Tan,Max
998,A839647,2021-08-12 14:04:00,2021-08-12T14:04:00.000,2017-07-25T00:00:00.000,Adoption,NaN,Dog,Neutered Male,4 years,Labrador Retriever,Black/White,Aksel
999,A840618,2021-08-12 13:23:00,2021-08-12T13:23:00.000,2010-10-11T00:00:00.000,Return to Owner,NaN,Dog,Neutered Male,10 years,Maltese,White,Muffins

### Multi-Indexing

In [12]:
# Same goes for multi-index groupbys
animal_outcome = animals.groupby(['animal_type', 'outcome_type'])
animal_outcome.groups

{('Other', 'Euthanasia'): [0, 1, 2, 33, 53, 69, 138, 277, 278, 334, 563, 566, 660, 986], ('Dog', 'Adoption'): [3, 6, 10, 20, 21, 22, 23, 25, 26, 27, 32, 43, 44, 49, 51, 52, 55, 57, 58, 59, 62, 64, 65, 73, 77, 80, 93, 97, 105, 106, 113, 115, 116, 119, 124, 125, 126, 127, 133, 136, 137, 143, 145, 146, 148, 150, 151, 152, 153, 154, 156, 163, 165, 178, 180, 185, 188, 190, 194, 196, 209, 218, 219, 227, 228, 230, 232, 234, 236, 238, 241, 243, 248, 249, 257, 258, 262, 263, 268, 269, 274, 276, 284, 286, 289, 296, 297, 298, 299, 300, 305, 308, 309, 341, 344, 345, 346, 347, 349, 350, ...], ('Dog', 'Euthanasia'): [4, 480, 505], ('Cat', 'Adoption'): [5, 7, 8, 9, 11, 12, 18, 19, 24, 31, 35, 45, 46, 47, 48, 50, 54, 56, 63, 66, 68, 70, 71, 75, 82, 84, 92, 95, 98, 100, 112, 117, 118, 120, 122, 123, 128, 129, 130, 131, 144, 147, 149, 155, 158, 168, 169, 170, 173, 174, 179, 183, 186, 189, 191, 192, 193, 195, 216, 220, 221, 222, 223, 224, 225, 231, 233, 235, 237, 239, 240, 242, 245, 246, 247, 250, 251, 252, 253, 254, 255, 264, 265, 266, 267, 272, 273, 275, 281, 282, 283, 285, 290, 301, 303, 304, 306, 307, 320, 326, ...], ('Cat', 'Transfer'): [13, 14, 15, 16, 17, 67, 86, 87, 88, 89, 90, 91, 96, 101, 108, 111, 134, 135, 141, 157, 166, 167, 172, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 292, 293, 294, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 356, 357, 358, 359, 360, 361, 374, 375, 376, 390, 391, 392, 393, 394, 395, 425, 426, 427, 433, 436, 438, 440, 441, 451, 456, 466, 475, 476, 477, 492, 493, 511, 526, 564, 565, 681, 682, 683, 698, 699, 700, 701, 702, 721, 725, 726, 727, 728, 745, 776, 780, 781, 782, ...], ('Cat', 'Euthanasia'): [28, 139, 140, 184, 213, 259, 302, 445, 545, 609, 779, 855, 975], ('Dog', 'Transfer'): [29, 30, 34, 36, 38, 39, 40, 41, 42, 60, 61, 72, 76, 99, 102, 103, 104, 107, 109, 110, 159, 164, 171, 175, 176, 177, 187, 210, 211, 212, 244, 270, 287, 288, 295, 321, 322, 323, 324, 325, 330, 338, 339, 355, 367, 368, 377, 378, 380, 381, 403, 407, 423, 494, 495, 496, 497, 498, 499, 500, 528, 597, 598, 606, 631, 656, 659, 668, 716, 717, 720, 738, 761, 810, 820, 821, 874, 880, 881, 882, 883, 884, 885, 886, 903, 914, 919, 925, 983], ('Dog', 'Return to Owner'): [37, 74, 79, 81, 85, 114, 142, 208, 217, 229, 260, 261, 271, 279, 327, 328, 329, 333, 336, 399, 406, 408, 410, 417, 421, 431, 437, 439, 462, 471, 473, 474, 487, 504, 531, 532, 547, 550, 616, 618, 654, 655, 658, 661, 662, 665, 711, 712, 718, 719, 785, 814, 815, 822, 823, 833, 852, 853, 856, 872, 879, 897, 968, 989, 999], ('Other', 'Rto-Adopt'): [78], ('Dog', 'Rto-Adopt'): [83, 94, 121, 132, 280, 621, 626, 790], ('Other', 'Transfer'): [160, 161, 162, 811], ('Other', 'Adoption'): [181, 182, 291, 363, 364, 365, 366, 420, 601, 966, 967, 970, 971], ('Cat', 'Died'): [214, 215, 402, 489], ('Dog', nan): [226], ('Dog', 'Died'): [256, 424], ('Cat', 'Disposal'): [343], ('Cat', 'Return to Owner'): [388, 479, 663, 664, 813, 878, 938], ('Other', 'Disposal'): [458, 724], ('Bird', 'Euthanasia'): [593, 604], ('Cat', 'Rto-Adopt'): [722], ('Other', 'Return to Owner'): [732, 911, 912, 913]}

In [15]:
# animal_outcome.groups is a dictionary, so we can access the group names using keys()
animal_outcome.groups.keys()

dict_keys([('Other', 'Euthanasia'), ('Dog', 'Adoption'), ('Dog', 'Euthanasia'), ('Cat', 'Adoption'), ('Cat', 'Transfer'), ('Cat', 'Euthanasia'), ('Dog', 'Transfer'), ('Dog', 'Return to Owner'), ('Other', 'Rto-Adopt'), ('Dog', 'Rto-Adopt'), ('Other', 'Transfer'), ('Other', 'Adoption'), ('Cat', 'Died'), ('Dog', nan), ('Dog', 'Died'), ('Cat', 'Disposal'), ('Cat', 'Return to Owner'), ('Other', 'Disposal'), ('Bird', 'Euthanasia'), ('Cat', 'Rto-Adopt'), ('Other', 'Return to Owner')])

In [16]:
animals['animal_type'].value_counts()

Cat      491
Dog      469
Other     38
Bird       2
Name: animal_type, dtype: int64

In [ ]:
animals['outcome_type'].value_counts()

In [17]:
# We can then get a specific group, such as cats that were adopted
animal_outcome.get_group(('Cat', 'Adoption'))

,animal_id,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,name
5,A840489,2021-09-05 18:08:00,2021-09-05T18:08:00.000,2021-04-25T00:00:00.000,Adoption,NaN,Cat,Neutered Male,4 months,Domestic Shorthair,Brown Tabby,*Charlie
7,A839337,2021-09-05 17:47:00,2021-09-05T17:47:00.000,2021-05-05T00:00:00.000,Adoption,NaN,Cat,Spayed Female,4 months,Domestic Shorthair Mix,Tortie,Tina Turner
8,A841761,2021-09-05 17:33:00,2021-09-05T17:33:00.000,2021-05-02T00:00:00.000,Adoption,NaN,Cat,Spayed Female,4 months,Domestic Shorthair Mix,Torbie,Papaya
9,A841763,2021-09-05 17:32:00,2021-09-05T17:32:00.000,2021-05-02T00:00:00.000,Adoption,NaN,Cat,Spayed Female,4 months,Domestic Shorthair Mix,Tortie,Mango
11,A841210,2021-09-05 17:13:00,2021-09-05T17:13:00.000,2013-09-05T00:00:00.000,Adoption,NaN,Cat,Neutered Male,8 years,Domestic Longhair,Blue,Camus
...,...,...,...,...,...,...,...,...,...,...,...,...
974,A823674,2021-08-13 11:11:00,2021-08-13T11:11:00.000,2020-08-18T00:00:00.000,Adoption,Foster,Cat,Neutered Male,11 months,Domestic Shorthair,Black/White,*River
976,A840570,2021-08-12 19:01:00,2021-08-12T19:01:00.000,2021-05-10T00:00:00.000,Adoption,NaN,Cat,Spayed Female,3 months,Domestic Shorthair,Orange Tabby,*Neko
981,A839838,2021-08-12 18:39:00,2021-08-12T18:39:00.000,2021-06-06T00:00:00.000,Adoption,NaN,Cat,Spayed Female,2 months,Domestic Medium Hair,Brown Tabby,A839838
982,A837241,2021-08-12 17:27:00,2021-08-12T17:27:00.000,2021-05-17T00:00:00.000,Adoption,Foster,Cat,Spayed Female,2 months,Domestic Shorthair,Lynx Point,A837241
987,A839550,2021-08-12 16:21:00,2021-08-12T16:21:00.000,2021-05-08T00:00:00.000,Adoption,NaN,Cat,Spayed Female,3 months,Domestic Shorthair Mix,Calico,A839550

## Aggregating

Once again, as we will see in SQL, groupby objects are intended to be used with aggregation. In SQL, we will see that our queries that include GROUP BY require aggregation performed on columns.

We can use `.sum()`, `.mean()`, `.count()`, `.max()`, `.min()`, etc. Find a list of common aggregations [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html).

In [20]:
animals.groupby('animal_type').count()

,animal_id,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,sex_upon_outcome,age_upon_outcome,breed,color,name
animal_type,,,,,,,,,,,
Bird,2,2,2,2,2,2,2,2,2,2,1
Cat,491,491,491,491,491,220,491,491,491,491,430
Dog,469,469,469,469,468,141,469,469,469,469,452
Other,38,38,38,38,38,23,38,38,38,38,19

## Exercise

Use `.groupby()` to find the most recently born of each (main) animal type.

In [22]:
animals.groupby('animal_type')['date_of_birth'].max()

animal_type
Bird     2020-08-22T00:00:00.000
Cat      2021-09-01T00:00:00.000
Dog      2021-08-21T00:00:00.000
Other    2021-08-03T00:00:00.000
Name: date_of_birth, dtype: object

In [24]:
animals[(animals['animal_type'] == 'Bird') & (animals['date_of_birth'] == '2020-08-22T00:00:00.000')]

,animal_id,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,name
593,A841169,2021-08-22 15:36:00,2021-08-22T15:36:00.000,2020-08-22T00:00:00.000,Euthanasia,Suffering,Bird,Unknown,1 year,Parakeet,Blue,NaN

<details>
    <summary>Answer</summary>

```python
animals.groupby('animal_type')['date_of_birth'].max()
```
</details>

# Pivoting a DataFrame

## `.pivot_table()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

Grouping by two different columns can be very helpful.

In [25]:
animals.groupby(by=['outcome_type', 'sex_upon_outcome']).agg(len)

                                  animal_id  datetime  monthyear  \
outcome_type    sex_upon_outcome
Adoption        Intact Female            18        18         18
                Intact Male               7         7          7
                Neutered Male           324       324        324
                Spayed Female           306       306        306
Died            Intact Female             2         2          2
                Intact Male               3         3          3
                Spayed Female             1         1          1
Disposal        Unknown                   3         3          3
Euthanasia      Intact Female             4         4          4
                Intact Male               4         4          4
                Neutered Male             4         4          4
                Spayed Female             1         1          1
                Unknown                  19        19         19
Return to Owner Intact Female            19        19         19
                Intact Male              23        23         23
                Neutered Male            17        17         17
                Spayed Female            15        15         15
                Unknown                   2         2          2
Rto-Adopt       Intact Male               1         1          1
                Neutered Male             9         9          9
Transfer        Intact Female            86        86         86
                Intact Male              71        71         71
                Neutered Male            22        22         22
                Spayed Female            18        18         18
                Unknown                  20        20         20

                                  date_of_birth  outcome_subtype  animal_type  \
outcome_type    sex_upon_outcome
Adoption        Intact Female                18               18           18
                Intact Male                   7                7            7
                Neutered Male               324              324          324
                Spayed Female               306              306          306
Died            Intact Female                 2                2            2
                Intact Male                   3                3            3
                Spayed Female                 1                1            1
Disposal        Unknown                       3                3            3
Euthanasia      Intact Female                 4                4            4
                Intact Male                   4                4            4
                Neutered Male                 4                4            4
                Spayed Female                 1                1            1
                Unknown                      19               19           19
Return to Owner Intact Female                19               19           19
                Intact Male                  23               23           23
                Neutered Male                17               17           17
                Spayed Female                15               15           15
                Unknown                       2                2            2
Rto-Adopt       Intact Male                   1                1            1
                Neutered Male                 9                9            9
Transfer        Intact Female                86               86           86
                Intact Male                  71               71           71
                Neutered Male                22               22           22
                Spayed Female                18               18           18
                Unknown                      20               20           20

                                  age_upon_outcome  breed  color  name
outcome_type    sex_upon_outcome
Adoption        Intact Female                   18     18     18    18
                Intact Male                      7      7      7     7
                Neutered Male                  324    324    324   324
                Spayed Female                  306    306    306   306
Died            Intact Female                    2      2      2     2
                Intact Male                      3      3      3     3
                Spayed Female                    1      1      1     1
Disposal        Unknown                          3      3      3     3
Euthanasia      Intact Female                    4      4      4     4
                Intact Male                      4      4      4     4
                Neutered Male                    4      4      4     4
                Spayed Female                    1      1      1     1
                Unknown                         19     19     19    19
Return to Owner Intact Female                   19     19     19    19
                Intact Male                     23     23     23    23
                Neutered Male                   17     17     17    17
                Spayed Female                   15     15     15    15
                Unknown                          2      2      2     2
Rto-Adopt       Intact Male                      1      1      1     1
                Neutered Male                    9      9      9     9
Transfer        Intact Female                   86     86     86    86
                Intact Male                     71     71     71    71
                Neutered Male                   22     22     22    22
                Spayed Female                   18     18     18    18
                Unknown                         20     20     20    20

But it has the unsavory side effect of creating a two-level index. This can be a good time to use `.pivot_table()`.

(There is also a `.pivot()`. For the somewhat subtle differences, see [here](https://stackoverflow.com/questions/30960338/pandas-difference-between-pivot-and-pivot-table-why-is-only-pivot-table-workin).)

### Example

In [26]:
df = pd.DataFrame({"sex": ["male", "male", "male", "male", "male",
                          "female", "female", "female", "female"],
                    "num_puppies": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "breed": ["terrier", "retriever", "retriever", "terrier",
                          "terrier", "retriever", "terrier", "terrier",
                          "retriever"],
                    "past_owners": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "family_members": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

      sex num_puppies      breed  past_owners  family_members
0    male         one    terrier            1               2
1    male         one  retriever            2               4
2    male         one  retriever            2               5
3    male         two    terrier            3               5
4    male         two    terrier            3               6
5  female         one  retriever            4               6
6  female         one    terrier            5               8
7  female         two    terrier            6               9
8  female         two  retriever            7               9

In [27]:
# This first example aggregates values by taking the sum.

table = pd.pivot_table(df, values='past_owners', index=['sex', 'num_puppies'],
                     columns=['breed'], aggfunc=np.sum)
table

breed               retriever  terrier
sex    num_puppies
female one                4.0      5.0
       two                7.0      6.0
male   one                4.0      1.0
       two                NaN      6.0

### Back to Austin animals

In [28]:
animals.pivot_table(index='outcome_type', columns='sex_upon_outcome', aggfunc=len)

                 age_upon_outcome                                          \
sex_upon_outcome    Intact Female Intact Male Neutered Male Spayed Female
outcome_type
Adoption                     18.0         7.0         324.0         306.0
Died                          2.0         3.0           NaN           1.0
Disposal                      NaN         NaN           NaN           NaN
Euthanasia                    4.0         4.0           4.0           1.0
Return to Owner              19.0        23.0          17.0          15.0
Rto-Adopt                     NaN         1.0           9.0           NaN
Transfer                     86.0        71.0          22.0          18.0

                             animal_id                            \
sex_upon_outcome Unknown Intact Female Intact Male Neutered Male
outcome_type
Adoption             NaN          18.0         7.0         324.0
Died                 NaN           2.0         3.0           NaN
Disposal             3.0           NaN         NaN           NaN
Euthanasia          19.0           4.0         4.0           4.0
Return to Owner      2.0          19.0        23.0          17.0
Rto-Adopt            NaN           NaN         1.0           9.0
Transfer            20.0          86.0        71.0          22.0

                                        ...          name              \
sex_upon_outcome Spayed Female Unknown  ... Intact Female Intact Male
outcome_type                            ...
Adoption                 306.0     NaN  ...          18.0         7.0
Died                       1.0     NaN  ...           2.0         3.0
Disposal                   NaN     3.0  ...           NaN         NaN
Euthanasia                 1.0    19.0  ...           4.0         4.0
Return to Owner           15.0     2.0  ...          19.0        23.0
Rto-Adopt                  NaN     NaN  ...           NaN         1.0
Transfer                  18.0    20.0  ...          86.0        71.0

                                                     outcome_subtype  \
sex_upon_outcome Neutered Male Spayed Female Unknown   Intact Female
outcome_type
Adoption                 324.0         306.0     NaN            18.0
Died                       NaN           1.0     NaN             2.0
Disposal                   NaN           NaN     3.0             NaN
Euthanasia                 4.0           1.0    19.0             4.0
Return to Owner           17.0          15.0     2.0            19.0
Rto-Adopt                  9.0           NaN     NaN             NaN
Transfer                  22.0          18.0    20.0            86.0


sex_upon_outcome Intact Male Neutered Male Spayed Female Unknown
outcome_type
Adoption                 7.0         324.0         306.0     NaN
Died                     3.0           NaN           1.0     NaN
Disposal                 NaN           NaN           NaN     3.0
Euthanasia               4.0           4.0           1.0    19.0
Return to Owner         23.0          17.0          15.0     2.0
Rto-Adopt                1.0           9.0           NaN     NaN
Transfer                71.0          22.0          18.0    20.0

[7 rows x 50 columns]

## Exercise

Use `.pivot_table()` to add up the number of my tasks by category. 

>  Hint: Use `sum()` as your aggregating function.

In [29]:
tasks = pd.DataFrame({'category': ['house', 'house', 'school', 'school'],
                      'descr': ['kitchen', 'laundry', 'git', 'Python'],
                      'priority': [2, 3, 4, 1], 'num_tasks': [2, 1, 2, 3]})

tasks

  category    descr  priority  num_tasks
0    house  kitchen         2          2
1    house  laundry         3          1
2   school      git         4          2
3   school   Python         1          3

In [40]:
tasks.pivot_table(values='num_tasks', index='category', columns='descr', aggfunc=sum)

descr     Python  git  kitchen  laundry
category
house        NaN  NaN      2.0      1.0
school       3.0  2.0      NaN      NaN

<details>
    <summary>Answer</summary>

```python
tasks.pivot_table(values='num_tasks', index='category', aggfunc=sum)
```
</details>

# Methods for Combining DataFrames: `.join()`, `.merge()`, `pd.concat()`

## `.join()`

In [41]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns=['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns=['age', 'MP'])

toy1

   age   HP
0   63  142
1   33   47

In [42]:
toy2

   age   MP
0   63  100
1   33  200

In [43]:
# We can't just join these as they are, since we haven't specified our suffixes.

toy1.join(toy2)

ValueError: columns overlap but no suffix specified: Index(['age'], dtype='object')

In [44]:
toy1.join(toy2, lsuffix='1', rsuffix='2')

   age1   HP  age2   MP
0    63  142    63  100
1    33   47    33  200

If we don't want to keep both, we could set the overlapping column as the index in each DataFrame:

In [45]:
toy1.set_index('age').join(toy2.set_index('age'))

      HP   MP
age
63   142  100
33    47  200

In [48]:
toy1.join(toy2.drop('age', axis=1))

   age   HP   MP
0   63  142  100
1   33   47  200

For more on this method, check out the [doc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html)!

## `.merge()`

Or we could use `.merge()`:

In [49]:
toy1.merge(toy2)

   age   HP   MP
0   63  142  100
1   33   47  200

In [50]:
ds_chars = pd.read_csv('data/ds_chars.csv', index_col=0)
ds_chars

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [51]:
states = pd.read_csv('data/states.csv', index_col=0)
states

  state   nickname     capital
0    WA  evergreen     Olympia
1    TX      alamo      Austin
2    DC   district  Washington
3    OH    buckeye    Columbus
4    OR     beaver       Salem

## The `how` Parameter

This parameter in both `.join()` and `.merge()` tells the compiler what sort of join to effect. We'll cover this in detail when we discuss SQL.

In [52]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='inner')

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    WA  evergreen     Olympia
2    alan  170         TX    TX      alamo      Austin
3  rachel  200         TX    TX      alamo      Austin
4  alison  300         DC    DC   district  Washington

In [57]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='outer')

     name     HP home_state state   nickname     capital
0    greg  200.0         WA    WA  evergreen     Olympia
1   miles  200.0         WA    WA  evergreen     Olympia
2    alan  170.0         TX    TX      alamo      Austin
3  rachel  200.0         TX    TX      alamo      Austin
4  alison  300.0         DC    DC   district  Washington
5     NaN    NaN        NaN    OH    buckeye    Columbus
6     NaN    NaN        NaN    OR     beaver       Salem

## `pd.concat()`

This method takes a *list* of pandas objects as arguments.

In [58]:
ds_full = pd.concat([ds_chars, states])
ds_full

     name     HP home_state state   nickname     capital
0    greg  200.0         WA   NaN        NaN         NaN
1   miles  200.0         WA   NaN        NaN         NaN
2    alan  170.0         TX   NaN        NaN         NaN
3  alison  300.0         DC   NaN        NaN         NaN
4  rachel  200.0         TX   NaN        NaN         NaN
0     NaN    NaN        NaN    WA  evergreen     Olympia
1     NaN    NaN        NaN    TX      alamo      Austin
2     NaN    NaN        NaN    DC   district  Washington
3     NaN    NaN        NaN    OH    buckeye    Columbus
4     NaN    NaN        NaN    OR     beaver       Salem

`pd.concat()`–– and many other pandas operations –– make use of an `axis` parameter. For this particular method I need to specify whether I want to concatenate the DataFrames *row-wise* (`axis=0`) or *column-wise* (`axis=1`). The default is `axis=0`, so let's override that!

In [59]:
ds_full = pd.concat([ds_chars, states], axis=1)
ds_full

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    TX      alamo      Austin
2    alan  170         TX    DC   district  Washington
3  alison  300         DC    OH    buckeye    Columbus
4  rachel  200         TX    OR     beaver       Salem

# King County Assessments

As data scientists, we want to build a model to predict the sale price of a house in Seattle in 2019, based on its square footage. We know that the King County Department of Assessments has comprehensive data available on real property sales in the Seattle area. We need to prepare the data.

## First, get the data!

Go [here](https://info.kingcounty.gov/assessor/DataDownload/default.aspx) and download two files: "Real Property Sales" and "Residential Building". Then unzip them. (Or you can run the cells below if you prefer.)

In [ ]:
# %%bash
# cd data
# curl -o property_sales.zip https://aqua.kingcounty.gov/extranet/assessor/Real%20Property%20Sales.zip

In [ ]:
# %%bash
# cd data
# curl -o res_bldg.zip https://aqua.kingcounty.gov/extranet/assessor/Residential%20Building.zip

In [ ]:
# zf = ZipFile('data/property_sales.zip', 'r')
# zf.extractall('data')
# zf.close()

In [ ]:
# zf = ZipFile('data/res_bldg.zip', 'r')
# zf.extractall('data')
# zf.close()

In [60]:
# You'll need to use a new encoding here. List of all encodings here:
# https://docs.python.org/3/library/codecs.html#standard-encodings

# Both of these csv files have many columns, so we'll just pre-select
# which ones we want to use.

sales_df = pd.read_csv('EXTR_RPSale.csv',
                       encoding='latin-1',
                       usecols=['Major', 'Minor', 'DocumentDate', 'SalePrice'])

/Users/jeffreymarvel/opt/anaconda3/envs/learn-env/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3145: DtypeWarning: Columns (1,2) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [61]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2184250 entries, 0 to 2184249
Data columns (total 4 columns):
 #   Column        Dtype
---  ------        -----
 0   Major         object
 1   Minor         object
 2   DocumentDate  object
 3   SalePrice     int64
dtypes: int64(1), object(3)
memory usage: 66.7+ MB

In [62]:
bldg_df = pd.read_csv('EXTR_ResBldg.csv',
                     usecols=['Major', 'Minor', 'SqFtTotLiving', 'ZipCode'])

/Users/jeffreymarvel/opt/anaconda3/envs/learn-env/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3145: DtypeWarning: Columns (11) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [65]:
bldg_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 521332 entries, 0 to 521331
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Major          521332 non-null  int64
 1   Minor          521332 non-null  int64
 2   ZipCode        470711 non-null  object
 3   SqFtTotLiving  521332 non-null  int64
dtypes: int64(3), object(1)
memory usage: 15.9+ MB

In [68]:
sales_data = pd.merge(sales_df, bldg_df, on=['Major', 'Minor'])

In [69]:
sales_data.head()

  Major Minor DocumentDate  SalePrice ZipCode  SqFtTotLiving
0  4000   228   04/29/1997     103500   98168           1560
1  4000   228   10/15/2014     221900   98168           1560
2  4000   228   08/28/2020          0   98168           1560
3  4000   228   05/06/2005     198000   98168           1560
4  4000   228   04/26/2019     369000   98168           1560

In [70]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1519123 entries, 0 to 1519122
Data columns (total 6 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   Major          1519123 non-null  object
 1   Minor          1519123 non-null  object
 2   DocumentDate   1519123 non-null  object
 3   SalePrice      1519123 non-null  int64
 4   ZipCode        1382847 non-null  object
 5   SqFtTotLiving  1519123 non-null  int64
dtypes: int64(2), object(4)
memory usage: 81.1+ MB

We can see right away that we're missing ZIP codes for many of the sales transactions.

In [71]:
sales_data.loc[sales_data['ZipCode'].isna()].head()

     Major Minor DocumentDate  SalePrice ZipCode  SqFtTotLiving
28  226700   160   05/08/2003          0     NaN           1560
29  226700   160   05/11/1996          0     NaN           1560
30  226700   160   09/08/2011          0     NaN           1560
31  226700   160   10/09/2018     855000     NaN           1560
32  226700   160   01/24/2020          0     NaN           1560

## Exercise

What percentage of housing records are missing ZIP codes?

<details>
    <summary>Answer</summary>

```python
sales_data['ZipCode'].isna().sum() / sales_data.shape[0]
```
</details>

Let's drop the rows with missing zip codes.

In [ ]:
sales_data = sales_data.loc[~sales_data['ZipCode'].isna(), :]

sales_data.head()

# Time Permitting: Data Cleaning Exercises with Pandas

## Investigate and drop rows with invalid values in the SalePrice and SqFtTotLiving columns.

<details>
    <summary>One possible answer here</summary>

```python
sales_data = sales_data[sales_data['SalePrice'] > 10000]
```
</details>

## Investigate and handle non-numeric ZipCode values

Can you find a way to shorten ZIP+4 codes to the first five digits?

In [ ]:
def is_integer(x):
    try:
        _ = int(x)
    except ValueError:
        return False
    return True

sales_data.loc[sales_data['ZipCode'].apply(is_integer) == False, 'ZipCode'].head()

<details>
    <summary>One possible answer here</summary>

```python
def five_digit_ZIP(x):
    try:
        return int(str(x)[:5])
    except:
        return x
    
sales_data['ZipCode'] = sales_data['ZipCode'].map(five_digit_ZIP)
sales_data = sales_data.loc[sales_data['ZipCode'].apply(is_integer) == True, :]
sales_data['ZipCode'] = sales_data['ZipCode'].map(int)
```
</details>

## Add a column for PricePerSqFt

<details>
    <summary>Answer here</summary>

```python
sales_data['PricePerSqFt'] = sales_data['SalePrice'] / sales_data['SqFtTotLiving']
```
</details>

## Subset the data to 2021 sales only

We can assume that the DocumentDate is approximately the sale date.

<details>
    <summary>Answer here</summary>

```python
sales_data['DocumentDate'] = pd.to_datetime(sales_data['DocumentDate'])
sales_data = sales_data.loc[sales_data['DocumentDate'] > '12/31/2020']
```
</details>

## What is the mean price per square foot for a house sold in Seattle in 2021?

<details>
    <summary>Answer here</summary>

```python
sales_data['PricePerSqFt'].mean()
```
</details>

# Level Up: `pandas.set_option()`

We can adjust how `pandas` works by setting options in advance.

For complete documentation, see [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html).

## Block Scientific Notation

For example, suppose we want to prevent numbers from being displayed in scientific notation.

In [ ]:
df = pd.DataFrame([[1e9, 2e9], [3e9, 4e9]])
df

Then we can use:

In [ ]:
pd.set_option('display.float_format', '{:.2f}'.format)

df

## See More Rows

Or suppose we want `pandas` to show more rows.

In [ ]:
df2 = pd.DataFrame(np.array(range(100)))
df2

In that case we can use:

In [ ]:
pd.set_option('display.max_rows', 100)

df2